# Data Exploration

# Calculate mean, median, mode, min, max, and standard deviation for a dataset.

In [1]:
import numpy as np
import pandas as pd

In [2]:
dt = pd.read_csv('test.csv')

In [3]:
dt.head()

,id,title,Rating,maincateg,platform,actprice1,norating1,noreviews1,star_5f,star_4f,star_3f,star_2f,star_1f,fulfilled1
0,2242,Casuals For Men (Blue),3.8,Men,Flipkart,999,27928,3543,14238.0,4295,3457,1962,3976.0,1
1,20532,Women Black Flats Sandal,3.9,Women,Flipkart,499,3015,404,1458.0,657,397,182,321.0,1
2,10648,Women Gold Wedges Sandal,3.9,Women,Flipkart,999,449,52,229.0,70,71,33,46.0,1
3,20677,Men's Height Increasing High Heel Formal Party...,3.9,Men,Flipkart,2999,290,40,141.0,51,49,17,32.0,1
4,12593,Loafers For Men (Tan),3.9,Men,Flipkart,999,2423,326,1265.0,414,293,143,308.0,0

In [4]:
dt.shape

(5244, 14)

In [5]:
dt.mean()

C:\Users\admin\AppData\Local\Temp\ipykernel_4600\2162581429.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dt.mean()

id            10507.372616
Rating            4.011089
actprice1      1378.657895
norating1      2988.580092
noreviews1      415.491037
star_5f        1557.443199
star_4f         639.785469
star_3f         356.356789
star_2f         154.139969
star_1f         270.397786
fulfilled1        0.604500
dtype: float64

In [6]:
dt.median()

C:\Users\admin\AppData\Local\Temp\ipykernel_4600\3024937849.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dt.median()

id            10561.5
Rating            4.0
actprice1       999.0
norating1       307.0
noreviews1       44.0
star_5f         156.0
star_4f          61.0
star_3f          34.0
star_2f          16.0
star_1f          29.0
fulfilled1        1.0
dtype: float64

In [7]:
dt.max()

C:\Users\admin\AppData\Local\Temp\ipykernel_4600\3655180176.py:1: FutureWarning: The default value of numeric_only in DataFrame.max is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dt.max()

id                                                        20964
title          Bellies For Women( beige stone) Bellies For W...
Rating                                                      5.0
platform                                               Flipkart
actprice1                                                 15999
norating1                                                289973
noreviews1                                                45448
star_5f                                                151193.0
star_4f                                                   74037
star_3f                                                   49924
star_2f                                                   12629
star_1f                                                 23139.0
fulfilled1                                                    1
dtype: object

In [8]:
dt.min()

C:\Users\admin\AppData\Local\Temp\ipykernel_4600\649288367.py:1: FutureWarning: The default value of numeric_only in DataFrame.min is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dt.min()

id                 0
title              0
Rating           0.0
platform      Amazon
actprice1        139
norating1          1
noreviews1         0
star_5f          0.0
star_4f            0
star_3f            0
star_2f            0
star_1f          0.0
fulfilled1         0
dtype: object

In [9]:
dt.std()

C:\Users\admin\AppData\Local\Temp\ipykernel_4600\2572274960.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dt.std()

id             5978.658892
Rating            0.301915
actprice1      1280.630070
norating1     12881.253715
noreviews1     1910.726669
star_5f        6583.766998
star_4f        2991.065223
star_3f        1632.732834
star_2f         611.006799
star_1f        1035.085288
fulfilled1        0.489004
dtype: float64

In [10]:
dt.mode()

,id,title,Rating,maincateg,platform,actprice1,norating1,noreviews1,star_5f,star_4f,star_3f,star_2f,star_1f,fulfilled1
0,0,Flip Flops,4.1,Women,Flipkart,999.0,6.0,1.0,4.0,1.0,0.0,0.0,0.0,1.0
1,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,22,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5239,20942,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5240,20943,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5241,20948,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5242,20958,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5243,20964,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
dt.mode().iloc[0]

id                     0
title         Flip Flops
Rating               4.1
maincateg          Women
platform        Flipkart
actprice1          999.0
norating1            6.0
noreviews1           1.0
star_5f              4.0
star_4f              1.0
star_3f              0.0
star_2f              0.0
star_1f              0.0
fulfilled1           1.0
Name: 0, dtype: object